examples/cli/auto-benchmark/config.yaml
apiVersion: rbg.io/v1
kind: AutoBenchmarkConfig

# 实验名称（可选，不指定则自动生成 "exp-{timestamp}"）
# 所有输出归入 PVC 上的 /data/{name}/ 目录
name: my-experiment

# 引用 RBG template 文件
templates:
- name: single
  template: ./template.yaml

# 推理引擎 backend
backend: sglang   # sglang | vllm

# 参数搜索空间（覆盖 template 中 container command 的对应 flag）
searchSpace:
  default:                           # "default" 应用于所有 role
    gpuMemoryUtilization:
      type: float
      min: 0.70
      max: 0.95
      step: 0.05
    maxNumSeqs:
      type: pow2
      min: 256
      max: 2048
    chunkedPrefillSize:
      type: pow2
      min: 512
      max: 8192
    schedulePolicy:
      type: categorical
      values: ["lpm", "dfs-weight", "random"]

# 固定的 benchmark workload 场景（单一场景）
scenario:
  name: chat
  workloads:
  - "normal(512,256/2048,1024)"
  concurrency: [64, 128, 256]
  duration: 3m
  maxRequests: 500

# 优化目标和 SLA 约束
objectives:
  sla:
    ttftP99MaxMs: 2000       # TTFT P99 ≤ 2000ms
    tpotP99MaxMs: 15         # TPOT P99 ≤ 15ms
    errorRateMax: 0.01       # Error rate ≤ 1%
  optimize: outputThroughput # 在满足 SLA 前提下最大化此指标
                             # 可选: outputThroughput | inputThroughput | requestsPerSecond

# 搜索策略
strategy:
  algorithm: tpe             # grid | tpe | gp | cmaes | random | qmc | nsgaii | nsgaiii
  maxTrialsPerTemplate: 20   # 每个 template 最多试验次数
  earlyStopPatience: 5       # 连续 N 次无改善则跳过当前 template
  timeout: 4h                # 总超时
# 评估工具配置
evaluator:
  type: genai-bench
  config:
    tokenizerSource: Qwen/Qwen3-8B  # genai-bench --model-tokenizer（必填，HuggingFace ID 或本地路径）

# 结果存储 PVC
results:
  pvc: oss1-lj
  subPath: auto-benchmark    # PVC 内子路径，数据存储到 /data/ 对应 PVC 的此子目录

# 运行时参数
execution:
  rbgReadyTimeout: 15m       # 等待 RBG ready 超时
  trialTimeout: 30m          # 单次 trial 超时